#Простая арифметика
1234+4567
29-45
325/25
56*12
11*11
111*111
1111111*1111111
options(digits=14)
1111111*1111111
options(width=40)
5:32
options(width=50)
5:32
1:10
(1:10)+3
(1:10)-3
(1:10)*3
(1:10)^2
(1:10)^3
3:4
# остаток от деления 31 на 7
31 %% 7
# Целая часть от деления
31 %/% 7
7*4 + 3

#Графика и визуализация
x <-c(4, 1, 8, 9)
y <-c(6, 2, 4, 3)
plot(x,y)
# соединение точек линиями
lines(x,y)
x <- 1:50
y <- 2^x
plot(x,y)

# Столбчатые графики и круговые диаграммы
learn <-c("stats" = 15, "math"= 10,"programming" = 30, "attempts" = 45)
# круговая диаграмма
pie(learn)
# столбчатая диаграмма
barplot(learn)

# Гистограммы и моделирование
Z <- rnorm(1000)
hist(Z, prob = TRUE, main = "Гистограмма относительной частоты", sub = "Плотность распределения")
curve(dnorm(x), from = -3, to = 3, add = TRUE, col = "blue")